//#include <iostream>
//#include <vector>
//using namespace std;
//
//vector<vector<int>> bbq(vector<vector<int>> a) {
//	vector<int> c = a[0];
//	a[0] = a[1];
//	a[1] = c;
//	return a;
//
//}
//int main() {
//	////1차원 배열인 벡터
//	////2차원 배열인 벡터안의 벡터
//	////vector<vector<int>> v
//	//vector<vector<int>> v = {
//	//	{1,4,3,6,4},
//	//	{1,2,3,4},
//	//	{5,6,7,8},
//	//	{8,8,67,5,4,3}
//	//};
//	//for (int i = 0; i < 4; i++)
//	//{
//	//	for (int j = 0; j < v[i].size(); j++)
//	//	{
//	//		cout << v[i][j]<<" ";
//	//	}
//	//	cout << "\n";
//	//}
//	////생긴거는 배열인데 함수로 보내고 받았을때 원본값 수정 안됨
//	////배열은 포인터로 인해 원본이 바뀜
//
//	//----------------------------------------------------------------
//
//	//벡터 함수를 이용해서 아래줄 위에줄 바꿔보기.
//	//sawp(A,B) 바뀜. 배열이든 변수든 다 됨
//
//	
//	vector<vector<int >> v = { {1,5,4},{1,9,9} };
//
//		v=bbq(v);
//	for (int i = 0; i < 2; i++)
//	{
//		for (int j = 0; j < 3; j++)
//		{
//			cout << v[i][j];
//		}
//		cout << "\n";
//	}
//
//	//문제에 노드 숫자가 1부터 순차적 혹은 A부터 순차적이라면 노드번호
//	//노드번호라 생각하면서 문제 읽어보면 문제번호일거임
//
//}